<?php



//Поля контакта
$queryData = http_build_query(array(
    'fields' => array(
        "PHONE" =>   array(array("VALUE" => $data['billing_phone'], "VALUE_TYPE" => "WORK")), //телефон
        "EMAIL" =>   array(array("VALUE" => $data['billing_email'], "VALUE_TYPE" => "WORK")), // почта
        "NAME",   //имя
        "LAST_NAME",  //фамилия
        "ASSIGNED_BY_ID", //ID ответственного за контакт
        "COMPANY_ID", //id компании, в данном случае Семьи

        "UF_CRM_1550840562", //string, Дата рождения //15.03.2019 удалено и заменено на BIRTHDATE
        "UF_CRM_1550840604", //checkbox, Наличие загран. паспорта, 1/0
                        [
                            1,
                            0,
                        ],
    ),
));
$url = 'crm.contact.add.json'; // создание контакта;
$check_contact_url = 'crm.contact.list.json'; // поиск контакта





//Поля сделки
$query_data_first = array(
    'fields' => array(
        "TITLE" => 'Заполнена форма + название_формы ',//Название, обязательное поле!!!
        "ASSIGNED_BY_ID", //Ответстввенный
        "COMMENTS", //Поле для комментариев
        "COMPANY_ID", //id компании, в данном случае Семьи
        "CONTACT_ID", //id контакта/клиента
        "CATEGORY_ID", //Направление сделки: 0 - Вступление, 1- курсы, 2 - обучающие туры
                        [
                            0, //Вступление
                            1, //курсы
                            2, //обучающие туры
                        ],
        "UF_CRM_1550841409", //checkbox, С условиями ознакомлен, 1/0
                        [
                            1,
                            0,
                        ],
        "UF_CRM_1550841300", //string,Телефон батьків
        "UF_CRM_1550841387", //string, Полных лет
        "UF_CRM_1550841476", //string, Направление деятельности, специальность
        "UF_CRM_1550845849", //textarea, Доп. вопросы от клиента


        "UF_CRM_1550843279", //select, Цель проходжения курсов
                        [
                            63, //Вступ до польського ВНЗ
                            64, //Інше
                        ],
        "UF_CRM_1550843015", //select, Тип курсов:
                        [
                            59, //Курси у Вашому місті
                            60, //Курси онлайн по Skype
                            61, //Інтенсивні курси у Варшаві
                            62, //Заняття з репетитором
                        ],

        "UF_CRM_1550841969", //select, Регион:
                        [
                            32, //Киев
                            33, //Вінницька область
                            34, //Волинська область
                            35, //Дніпропетровська область
                            36, //Донецька область
                            37, //Житомирська область
                            38, //Закарпатська область
                            39, //Запорізька область
                            40, //Івано-Франківська область
                            41, //Київська область
                            42, //Кіровоградська область
                            43, //Луганська область
                            44, //Львівська область
                            45, //Миколаївська область
                            46, //Одеська область
                            47, //Полтавська область
                            48, //Рівненська область
                            49, //Сумська область
                            50, //Тернопільська область
                            51, //Харківська область
                            52, //Херсонська область
                            53, //Хмельницька область
                            54, //Черкаська область
                            55, //Чернівецька область
                            56, //Чернігівська область
                            57, //м. Севастополь
                            58, //АР Крим
                        ],


        //Метки
        "UTM_CAMPAIGN", //string
        "UTM_CONTENT", //string
        "UTM_MEDIUM", //string
        "UTM_SOURCE", //string
        "UTM_TERM", //string

    ),
);
$url = 'crm.deal.add.json';

//Поля компании (семьи):
array(
    'TITLE', //Название семьи
    'COMPANY_TYPE', //тип,
                [
                    'CUSTOMER', //Клиенты - !!! Ставьте это значение
                    'PARTNER', //Партнеры
                    'OTHER', //Другое
                ],
    'CONTACT_ID', // контакты, прикрепленных к компании (семье)
    'ASSIGNED_BY_ID', //ID ответственного сотрудника за компанию (семью)
);




//Вебхук
$queryUrl = 'https://b24.univerpl.com.ua/rest/1/jh9chey1kewj94f8/'.$url; //Вебхук с правами CRM