<?php

//Поля лида

[
    'TITLE' => 'Название формы + язык',
    'LAST_NAME' => '', //Фамилия
    'NAME' => '', //Имя
    'SECOND_NAME' => '', //Отчество
    'PHONE' =>   array(array("VALUE" => '', "VALUE_TYPE" => "WORK")), //телефон
    'EMAIL' =>   array(array("VALUE" => '', "VALUE_TYPE" => "WORK")), // почта

    'BIRTHDATE' => '', //date, дата рождения
    'SOURCE_ID' => 'WEB', //select, ID источника "Веб-сайт https://www.univerpl.com.ua/"
    'COMMENTS' => '', //Поле для комментариев
    'UF_CRM_1553159122141' => '', //string Телефон 1 (родетеля) блок "родич 1) для "Телефон одного з батьків"
    'UF_CRM_1553161243120' => '', //string Бажаний напрямок або спеціальність
    'UF_CRM_1553173176' => '', //textarea Додаткові запитання від клієнта

    "ASSIGNED_BY_ID", //Ответстввенный за лид, нужно уточнить у клиента, кого ставить.

    'UF_CRM_1553173488' => //select, Цель проходжения курсов
    [
        143, //Вступ до польського ВНЗ
        144, //Інше
    ],

    "UF_CRM_1553173807", //select, Тип курсов:
    [
        145, //Курси у Вашому місті
        146, //Курси онлайн по Skype
        147, //Інтенсивні курси у Варшаві
        148, //Заняття з репетитором
    ],

    "UF_CRM_1553174181", //select, Наявність закордонного паспорта:
    [
        0, //Нет
        1, //Да
    ],

    "UF_CRM_1553160276" => //select, Регион:
    [
        697, //Киев
        698, //Вінницька область
        699, //Волинська область
        700, //Дніпропетровська область
        701, //Донецька область
        702, //Житомирська область
        703, //Закарпатська область
        704, //Запорізька область
        705, //Івано-Франківська область
        706, //Київська область
        707, //Кіровоградська область
        708, //Луганська область
        709, //Львівська область
        710, //Миколаївська область
        711, //Одеська область
        712, //Полтавська область
        713, //Рівненська область
        714, //Сумська область
        715, //Тернопільська область
        716, //Харківська область
        717, //Херсонська область
        718, //Хмельницька область
        719, //Черкаська область
        720, //Чернівецька область
        721, //Чернігівська область
        722, //м. Севастополь
        723, //АР Крим
    ],
];